duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_uart_over_ble_main main.c
 * @{
 * @ingroup  ble_sdk_app_nus_eval
 * @brief    UART over BLE application main file.
 *
 * This file contains the source code for a sample application that uses the Nordic UART service.
 * This application uses the @ref srvlib_conn_params module.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "app_button.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp.h"
#include "bsp_btn_ble.h"

// -----------------------------------------------------------------------------
// for global definition
#define SERIAL_RECEIVER
#define WAVESHARE_BOARD

// for debugging
#define DEBUG_RTT_ERROR

#define DEBUG_OUTPUT_TIMER
// #define DEBUG_OUTPUT_BT_RECEIVED_DATA
// #define DEBUG_OUTPUT_BT_COMMAND_PARSER
// #define DEBUG_OUTPUT_BT_CHANNEL_PARSER
// #define DEBUG_OUTPUT_FC_CHANNEL_DATA
// #define DEBUG_OUTPUT_BT_RESPONSE
#define DEBUG_OUTPUT_FAILSAFE_MODE
#define DEBUG_OUTPUT_BLE_EVENT

// -----------------------------------------------------------------------------
// for debugging...
#if defined(WAVESHARE_BOARD)
#define WAVESHARE_LED_1                                  18
#define WAVESHARE_LED_2                                  19
#define WAVESHARE_LED_3                                  20
#define WAVESHARE_LED_4                                  21
#define WAVESHARE_LED_5                                  22
#endif

// -----------------------------------------------------------------------------
// for serial rx transmitter
#define SERIAL_RX_TRANSMITTER_MAX_SIZE                   64

// -----------------------------------------------------------------------------
// protocol for phone and bt's receiver
#define PROTOCOL_BASIC_MAX_SIZE                          8
#define PROTOCOL_CHANNEL_MAX_SIZE                        32

// 20 bytes is max size of bluetooth in the android.
// And then, send channels data by twice.
#define PROTOCOL_PACKET_BASIC_SIZE                       8
#define PROTOCOL_PACKET_EXTRA_SIZE                       16

#define PROTOCOL_HEADER_HIGH_VERSION                     0xD7
#define PROTOCOL_HEADER_LOW_VERSION                      0x5E

// Command (byte : 4 bit (phone -> transmitter : 0x0?, transmitter -> phone : 0xF?)
#define PROTOCOL_REGISTER_MESSAGE                        0x01
#define PROTOCOL_REGISTER_RESPONSE                       0xF1
#define PROTOCOL_ALIVE_MESSAGE                           0x02
#define PROTOCOL_ALIVE_RESPONSE                          0xF2
#define PROTOCOL_CHANNEL_MESSAGE                         0x03
#define PROTOCOL_CHANNEL_RESPONSE                        0xF3
#define PROTOCOL_UNKNOWN_RESPONSE                        0xFF

// channel id
// if it need modified id of channel, must be changed in the android.
// channel map : spektrum / Graupner / JR   : TAER1234, (Throttle, ROLL, PITCH, YAW)
//             : Default                    : AETR1234, (ROLL, PITCH, THROTTLE, YAW)
#define SPEKTRUM_CHANNEL_ROLL                            0
#define SPEKTRUM_CHANNEL_PITCH                           1
#define SPEKTRUM_CHANNEL_THROTTLE                        2
#define SPEKTRUM_CHANNEL_YAW                             3
#define SPEKTRUM_CHANNEL_GEAR                            4
#define SPEKTRUM_CHANNEL_AUX_1                           5
#define SPEKTRUM_CHANNEL_AUX_2                           6
#define SPEKTRUM_CHANNEL_AUX_3                           7
#define SPEKTRUM_CHANNEL_AUX_4                           8
#define SPEKTRUM_CHANNEL_AUX_5                           9
#define SPEKTRUM_CHANNEL_AUX_6                           10
#define SPEKTRUM_CHANNEL_AUX_7                           11
#define SPEKTRUM_MAX_CHANNEL                             12


// command & response
typedef struct _BT_PROTOCOL_COMMAND
{
   // 4 bytes
   uint8_t version_high;
   uint8_t version_low;
   uint8_t command;
   uint8_t size;

   // 4 bytes
   uint8_t option_1_high;
   uint8_t option_1_low;
   uint8_t option_2_high;
   uint8_t option_2_low;
} __attribute__ ((__packed__)) BT_PROTOCOL_COMMAND;

// channel
typedef struct _BT_PROTOCOL_CHANNEL_DATA
{
   // 8 bytes
   BT_PROTOCOL_COMMAND base_protocol;

   // 4 bytes
   uint16_t channel_1;                                   // ROLL
   uint16_t channel_2;                                   // PITCH

   // 4 bytes
   uint16_t channel_3;                                   // YAW
   uint16_t channel_4;                                   // THROTTLE

   // 4 bytes
   uint16_t channel_5;                                   // GEAR (Armming)
   uint16_t channel_6;                                   // AUX_1

   // 4 bytes
   uint16_t channel_7;                                   // AUX_2
   uint16_t channel_8;                                   // AUX_3

   // 4 bytes
   uint16_t channel_9;                                   // AUX_4
   uint16_t channel_10;                                  // AUX_5

   // 4 bytes
   uint16_t channel_11;                                  // AUX_6
   uint16_t channel_12;                                  // AUX_7
} __attribute__ ((__packed__)) BT_PROTOCOL_DATA;

// -----------------------------------------------------------------------------
enum BT_COMMAND_STATUS
{
   BT_COMMAND_READY                                      = 0,
   BT_COMMAND_RECEIVED                                   = 1,
   BT_COMMAND_PROCESS                                    = 3,
};

