duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
#define APP_TIMER_PRESCALER                              0                       /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE                          4                       /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL                                MSEC_TO_UNITS(20, UNIT_1_25_MS)  /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL                                MSEC_TO_UNITS(75, UNIT_1_25_MS)  /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                                    0                       /**< Slave latency. */
#define CONN_SUP_TIMEOUT                                 MSEC_TO_UNITS(4000, UNIT_10_MS)  /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY                   APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)   /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY                    APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)  /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT                     3                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define START_STRING                                     "Start...\r\n"

#define DEAD_BEEF                                        0xDEADBEEF              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                                 256                     /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                                 256                     /**< UART RX buffer size. */

static ble_nus_t                                         m_nus;                  /**< Structure to identify the Nordic UART Service. */
static uint16_t m_conn_handle                            = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

static ble_uuid_t m_adv_uuids[]                          = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};    /**< Universally unique service identifier. */
// -----------------------------------------------------------------------------


/******************************************************************
 *
 * Function Name : add_timer
 *
 *
 ******************************************************************/
static int add_timer(TIMER_FN fn, uint32_t ms_elapse, int count, void* pdata)
{
   int i;
   if (fn == NULL || ms_elapse == 0)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] function is null(%p) or ms_slapse is 0 (%d) \r\n", __FUNCTION__, __LINE__, fn, ms_elapse);
#endif
      return -1;
   }

#if defined(DEBUG_OUTPUT_TIMER)
      NRF_LOG_PRINTF("[%s-%d] fn=%p, ms_elapse = %d, count = %d, data = %p \r\n", __FUNCTION__, __LINE__, fn, ms_elapse, count, pdata);
#endif
   for (i = 0; i < MAX_TIMER_COUNT; i++)
   {
#if defined(DEBUG_OUTPUT_TIMER)
      NRF_LOG_PRINTF("[%s-%d] [%d] : %p \r\n", __FUNCTION__, __LINE__, i, gProject->timer[i].fn_timer);
#endif
      if (gProject->timer[i].fn_timer == NULL)
      {
         gProject->timer[i].tick_count                   = 0;
         gProject->timer[i].ms_elapse                    = ms_elapse;
         gProject->timer[i].call_count                   = count;
         gProject->timer[i].fn_timer                     = fn;
         gProject->timer[i].pData                        = pdata;
         return 0;
      }
   }
#if defined(DEBUG_RTT_ERROR)
   NRF_LOG_PRINTF("[%s-%d] timer is full (total timer = %d) \r\n", __FUNCTION__, __LINE__, MAX_TIMER_COUNT);
#endif
   return -1;
}

/******************************************************************
 *
 * Function Name : delete_timer
 *
 *
 ******************************************************************/
static int delete_timer(TIMER_FN fn)
{
   int i;
   if (fn == NULL)
   { 
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] function is null \r\n", __FUNCTION__, __LINE__);
#endif
      return -1;
   }
   for (i = 0; i < MAX_TIMER_COUNT; i++)
   {
      if (gProject->timer[i].fn_timer == fn)
      {
         gProject->timer[i].tick_count                   = 0;
         gProject->timer[i].ms_elapse                    = 0;
         gProject->timer[i].call_count                   = 0;
         gProject->timer[i].call_fn_count                = 0;
         gProject->timer[i].fn_timer                     = 0;
         gProject->timer[i].pData                        = NULL;
      }
   }
#if defined(DEBUG_RTT_ERROR)
   NRF_LOG_PRINTF("[%s-%d] Not found timer (%p) \r\n", __FUNCTION__, __LINE__, fn);
#endif
   return -1;
}


/******************************************************************
 *
 * Function Name : serial_receiver_timer_handler()
 *
 *
 ******************************************************************/
static void serial_receiver_timer_handler(void * p_context)
{
   uint32_t tick_count                                   = 0;
   uint32_t diff_tick_count                              = 0;
   int i;

   app_timer_cnt_get(&tick_count);

   for (i = 0; i < MAX_TIMER_COUNT; i++)
   {
      if (gProject->timer[i].tick_count == 0)
      {
         gProject->timer[i].tick_count                   = tick_count;
      }
      else
      {
         diff_tick_count                                 = 0;
         app_timer_cnt_diff_compute(tick_count, gProject->timer[i].tick_count, &diff_tick_count);

         if (diff_tick_count > MILLI_SECOND_TO_TICK_COUNT(gProject->timer[i].ms_elapse))
         {
            gProject->timer[i].tick_count                = tick_count;
            if (gProject->timer[i].call_count < 0)
            {
               (*gProject->timer[i].fn_timer)(gProject->timer[i].pData);
            }
            else if (gProject->timer[i].call_fn_count < gProject->timer[i].call_count)
            {
               (*gProject->timer[i].fn_timer)(gProject->timer[i].pData);
            }
         }
      }
   }
}



/******************************************************************
 *
 * Function Name : make_channel_data()
 *   make channel data from bt stream
 *
 ******************************************************************/
static void make_channel_data(uint16_t* p_bt_channel_data)
{
   int i;
   int channel_id;
   for (i = 0; i < SPEKTRUM_MAX_CHANNEL; i++)
   {
      channel_id                                         = ((p_bt_channel_data[i] >> 4) & 0x0F);
      gProject->channel_data[channel_id].channel_id      = channel_id;
      gProject->channel_data[channel_id].value           = ((p_bt_channel_data[i] >> 8) & 0x00FF) |
                                                           ((p_bt_channel_data[i] << 8) & 0x0F00) ;
   }
}

