duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
// -----------------------------------------------------------------------------
// for protocol of transmitter
#if defined(SERIAL_RECEIVER)

// -----------------------------------------------------------------------------
// protocol type
#define SERIAL_RX_SPEKTRUM_1024
// #define SERIAL_RX_SPEKTRUM_2048
// #define SERIAL_RX_S_BUS
// #define SERIAL_RX_SUMD
// #define SERIAL_RX_SUMH
// #define SERIAL_RX_MODE_B
// #define SERIAL_RX_MODE_B_BJ01
// #define SERIAL_RX_IBUS
// #define SERIAL_RX_MSP


// -----------------------------------------------------------------------------
#if defined(SERIAL_RX_SPEKTRUM_1024)

// -----------------------------------------------------------------------------
// for timer function
// spektrum 1024 : 22 ms
#define SERIAL_RX_SEND_TO_FC_TIMER                       22
// 60 ms
#define SERIAL_RX_COMMAND_PARSING_TIMER                  60
// 60 ms
#define SERIAL_RX_COMMAND_RESPONSE_TIMER                 60
// 500 ms
#define SERIAL_RX_COMMAND_FAILSAFE_TIMER                 100

// -----------------------------------------------------------------------------
// UART
// BAUDRATE : 125000 bps, or 1152000 bps
// DATA     : 8 bits
// PARITY   : NO Parity
// stop bit : 1 stop

// -----------------------------------------------------------------------------
#define SERIAL_RX_BAUDRATE                               (UART_BAUDRATE_BAUDRATE_Baud115200)
#define DEVICE_NAME                                      "DRONE-BT-CONTROLLER"                     /**< Name of device. Will be included in the advertising data. */

// -----------------------------------------------------------------------------
// for channel protocol
#define MAX_SPEKTRUM_CHANNEL_NUM                         7
#define SPEKTRUM_1024_CHANID_MASK                        0xFC00
#define SPEKTRUM_1024_SXPOS_MASK                         0x03FF
#define SPEKTRUM_1024_CHANNEL_SHIFT_BITS                 10

#define SPEKTRUM_DSM2_22MS                               0x01                    // 1024
#define SPEKTRUM_DSM2_11MS                               0x12                    // 2048
#define SPEKTRUM_DSMS_22MS                               0xA2                    // 2048
#define SPEKTRUM_DSMX_11MS                               0xB2                    // 2048

// struct for SPEKTRUM 1024 Protocol
typedef struct _RX_PACKET_SPEKTRUM_1024
{
   uint8_t fades;
   uint8_t system;
   uint16_t channel[MAX_SPEKTRUM_CHANNEL_NUM];
} __attribute__ ((__packed__)) RX_PACKET_SPEKTRUM_1024;

/******************************************************************
 *
 * Function Name : bt_packet_to_fc_packet()
 *   covert packet of bt to packet of fc 
 *
 ******************************************************************/
static int bt_packet_to_fc_packet()
{
   uint16_t i;
   uint16_t spektrum_channel_index                       = 0;

   RX_PACKET_SPEKTRUM_1024* pRxPacketSpektrum1024        = (RX_PACKET_SPEKTRUM_1024*) gProject->fc_tx_buffer;
   gProject->fc_tx_packet_size                           = sizeof(RX_PACKET_SPEKTRUM_1024);

   // header of spektrum's 1024
   pRxPacketSpektrum1024->fades                          = 0x0;
   pRxPacketSpektrum1024->system                         = SPEKTRUM_DSM2_22MS;

#if defined(DEBUG_OUTPUT_BT_CHANNEL_PARSER)
   NRF_LOG_PRINTF("------------------------------------------------------------- \r\n");
#endif

   for (i = 0; i < SPEKTRUM_MAX_CHANNEL; i++)
   {
      if (gProject->channel_data[i].channel_id < MAX_SPEKTRUM_CHANNEL_NUM)
      {
         pRxPacketSpektrum1024->channel[spektrum_channel_index] = (gProject->channel_data[i].channel_id << 2)           |
                                                                  ((gProject->channel_data[i].value << 8) & 0xFF00)     |
                                                                  ((gProject->channel_data[i].value >> 8) & 0x3);
         spektrum_channel_index++;
#if defined(DEBUG_OUTPUT_BT_CHANNEL_PARSER)
         NRF_LOG_PRINTF("channel id : %2d, value = %4d \r\n", gProject->channel_data[i].channel_id, gProject->channel_data[i].value);
#endif
      }
   }

#if defined(DEBUG_OUTPUT_BT_CHANNEL_PARSER)
   NRF_LOG_PRINTF("------------------------------------------------------------- \r\n");
#endif
   return 0;
}

// -----------------------------------------------------------------------------
// default value for failsafe mode ...
static BT_TRANSMITTER_CHANNEL_INFO g_failsafe_value[SPEKTRUM_MAX_CHANNEL] =
{
   { (SPEKTRUM_CHANNEL_ROLL),      512},
   { (SPEKTRUM_CHANNEL_PITCH),     512},
   { (SPEKTRUM_CHANNEL_THROTTLE),  0},
   { (SPEKTRUM_CHANNEL_YAW),       512},
   { (SPEKTRUM_CHANNEL_GEAR),      0},
   { (SPEKTRUM_CHANNEL_AUX_1),     0},
   { (SPEKTRUM_CHANNEL_AUX_2),     0},
   { (SPEKTRUM_CHANNEL_AUX_3),     0},
   { (SPEKTRUM_CHANNEL_AUX_4),     0},
   { (SPEKTRUM_CHANNEL_AUX_5),     0},
   { (SPEKTRUM_CHANNEL_AUX_6),     0},
   { (SPEKTRUM_CHANNEL_AUX_7),     0},
};

/******************************************************************
 *
 * Function Name : default_fc_packet()
 *   covert packet of bt to packet of fc 
 *
 ******************************************************************/
static int default_fc_packet(void* p_fc_packet, uint8_t* p_fc_acket_size)
{
   int i;
   RX_PACKET_SPEKTRUM_1024* pRxPacketSpektrum1024        = (RX_PACKET_SPEKTRUM_1024*) p_fc_packet;
   if (*p_fc_acket_size < sizeof(RX_PACKET_SPEKTRUM_1024))
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] packet size %d less than %d \r\n", __FUNCTION__, __LINE__, *p_fc_acket_size, sizeof(RX_PACKET_SPEKTRUM_1024));
#endif
      return -1;
   }

   // packet size of SPEKTRUM 1024
   *p_fc_acket_size                                      = sizeof(RX_PACKET_SPEKTRUM_1024);

   // header of spektrum's 1024
   pRxPacketSpektrum1024->fades                          = 0x0;
   pRxPacketSpektrum1024->system                         = SPEKTRUM_DSM2_22MS;

   for (i = 0; i < SPEKTRUM_MAX_CHANNEL; i++)
   {
      gProject->channel_data[i].channel_id            = g_failsafe_value[i].channel_id;
      gProject->channel_data[i].value                 = g_failsafe_value[i].value;
   }
   return 0;
}

