duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_INTERNAL_PACKET_SIZE;
#if defined(DEBUG_RTT_ERROR)
               NRF_LOG_PRINTF("[%s-%d] Wrong size or mismathed size from size of receive from bt(register cmd) \r\n", __FUNCTION__, __LINE__);
#endif
               return;
            }

            // check packet size
            if (pbtProtocolCommand->size != PROTOCOL_BASIC_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_PACKET_SIZE;
#if defined(DEBUG_RTT_ERROR)
               NRF_LOG_PRINTF("[%s-%d] Wrong packet size (alive msg) \r\n", __FUNCTION__, __LINE__);
#endif
               return;
            }
            break;

         case PROTOCOL_CHANNEL_MESSAGE :
            pbtProtocolResponse->command                 = PROTOCOL_UNKNOWN_RESPONSE;

            // check internal packet size
            if (rx_data_length != PROTOCOL_CHANNEL_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_INTERNAL_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_INTERNAL_PACKET_SIZE;
#if defined(DEBUG_RTT_ERROR)
               NRF_LOG_PRINTF("[%s-%d] Wrong size or mismathed size from size of receive from bt(register cmd) - %d \r\n", __FUNCTION__, __LINE__, rx_data_length);
#endif
               return;
            }

            // check packet size
            if (pbtProtocolCommand->size != PROTOCOL_CHANNEL_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_PACKET_SIZE;
#if defined(DEBUG_RTT_ERROR)
               NRF_LOG_PRINTF("[%s-%d] Wrong packet size (alive msg) \r\n", __FUNCTION__, __LINE__);
#endif
               return;
            }
            break;

         default :
            gProject->parsing_result_code                = ERROR_UNKNOWN_COMMAND;
            pbtProtocolResponse->command                 = PROTOCOL_UNKNOWN_RESPONSE;

            // error code
            pbtProtocolResponse->option_1_high           = 0;
            pbtProtocolResponse->option_1_low            = ERROR_UNKNOWN_COMMAND;
#if defined(DEBUG_RTT_ERROR)
            NRF_LOG_PRINTF("[%s-%d] unknown command \r\n", __FUNCTION__, __LINE__);
#endif
            return;
      }


      if (pbtProtocolCommand->version_high != PROTOCOL_HEADER_HIGH_VERSION)
      {
         gProject->parsing_result_code                   = ERROR_RESPONSE_VERSION;

         // error code
         pbtProtocolResponse->option_1_high              = 0;
         pbtProtocolResponse->option_1_low               = ERROR_RESPONSE_VERSION;
#if defined(DEBUG_RTT_ERROR)
         NRF_LOG_PRINTF("[%s-%d] mismatched version : %d, %d \r\n", __FUNCTION__, __LINE__, pbtProtocolCommand->version_high, PROTOCOL_HEADER_HIGH_VERSION);
#endif
         return;
      }

      if (pbtProtocolCommand->version_low != PROTOCOL_HEADER_LOW_VERSION)
      {
         gProject->parsing_result_code                   = ERROR_RESPONSE_VERSION;

         // error code
         pbtProtocolResponse->option_1_high              = 0;
         pbtProtocolResponse->option_1_low               = ERROR_RESPONSE_VERSION;
#if defined(DEBUG_RTT_ERROR)
         NRF_LOG_PRINTF("[%s-%d] mismatched version : %d, %d \r\n", __FUNCTION__, __LINE__, pbtProtocolCommand->version_low, PROTOCOL_HEADER_LOW_VERSION);
#endif
         return;
      }

      SET_PROJECT_NORMAL_STATUS(gProject->mode);
      app_timer_cnt_get(&(gProject->last_alive_tick_count));
      switch (pbtProtocolCommand->command)
      {
         case PROTOCOL_REGISTER_MESSAGE :
            if (gProject->register_client != 0)
            {
               gProject->parsing_result_code             = ERROR_ALREADY_REGISTERED;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_ALREADY_REGISTERED;
#if defined(DEBUG_OUTPUT_BT_COMMAND_PARSER)
//               NRF_LOG_PRINTF("already register \r\n");
#endif
               return;
            }
            else
            {
               // register client
               gProject->register_client                 = 1;
               return;
            }
            break;

         case PROTOCOL_ALIVE_MESSAGE :
            gProject->client_alive_count                 = (pbtProtocolCommand->option_1_high << 24) |
                                                           (pbtProtocolCommand->option_1_low  << 16) |
                                                           (pbtProtocolCommand->option_2_high << 8) |
                                                           (pbtProtocolCommand->option_1_low);
            return;

         case PROTOCOL_CHANNEL_MESSAGE :
            pbtProtocolChannelData                       = (BT_PROTOCOL_DATA*) gProject->bt_rx_buffer;

            // make channel data of internel from bt stream
            make_channel_data(&(pbtProtocolChannelData->channel_1));

            // make packet for fc from internel channel data
            bt_packet_to_fc_packet();
            return;

         default :
            gProject->parsing_result_code                = ERROR_UNKNOWN_COMMAND;

            // result code
            pbtProtocolResponse->option_1_high           = 0;
            pbtProtocolResponse->option_1_low            = ERROR_UNKNOWN_COMMAND;
            return;
      }
   }
   return;
}

/******************************************************************
 *
 * Function Name : timer_bt_response()
 *
 *
 ******************************************************************/
static void timer_bt_response(void* pdata)
{
   uint32_t err_code;

   if (gProject->parsing_status == 0)
   {
      return;
   }

#if defined(DEBUG_OUTPUT_BT_RESPONSE)
   {
static int timer_bt_response_count                       = 0;
      if ((timer_bt_response_count++ % 10) == 0)
      {
         int i;

         NRF_LOG_PRINTF("BT RESPONSE \r\n");
         for (i = 0; i < PROTOCOL_BASIC_MAX_SIZE; i++)
         {
            NRF_LOG_PRINTF("[0x%02X] ", gProject->bt_tx_buffer[i]);
         }
         NRF_LOG_PRINTF("\r\n");
      }
   }
#endif

   err_code                                              = ble_nus_string_send(&m_nus, gProject->bt_tx_buffer, PROTOCOL_BASIC_MAX_SIZE);
   if (err_code != NRF_SUCCESS)
   {
#if defined(DEBUG_OUTPUT_BT_RESPONSE)
      NRF_LOG_PRINTF("ble_nus_string_send() failed : %d \r\n", err_code);
#endif
   }
   gProject->parsing_status                              = 0;
}

/******************************************************************
 *
 * Function Name : timer_failsafe_mode()
 *
 *
 ******************************************************************/
static void timer_failsafe_mode(void* pdata)
{
   uint32_t diff_tick_count                              = 0;
   uint32_t cur_tick_count                               = 0;

