duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
   app_timer_cnt_get(&cur_tick_count);
   app_timer_cnt_diff_compute(cur_tick_count, gProject->last_alive_tick_count, &diff_tick_count);

#if defined(DEBUG_OUTPUT_FAILSAFE_MODE)
//   NRF_LOG_PRINTF("[%s-%d] failsafe mode : %d, %d \r\n", __FUNCTION__, __LINE__, TICK_COUNT_TO_SECOND(diff_tick_count), diff_tick_count);
#endif

   if (IS_PROJECT_FAILSAFE_MODE(gProject->mode))
   {
      gProject->channel_data[SPEKTRUM_CHANNEL_ROLL].value   = g_failsafe_value[SPEKTRUM_CHANNEL_ROLL].value;
      gProject->channel_data[SPEKTRUM_CHANNEL_PITCH].value  = g_failsafe_value[SPEKTRUM_CHANNEL_PITCH].value;
      gProject->channel_data[SPEKTRUM_CHANNEL_YAW].value    = g_failsafe_value[SPEKTRUM_CHANNEL_YAW].value;
      gProject->channel_data[SPEKTRUM_CHANNEL_AUX_1].value  = g_failsafe_value[SPEKTRUM_CHANNEL_AUX_1].value;
      gProject->channel_data[SPEKTRUM_CHANNEL_AUX_2].value  = g_failsafe_value[SPEKTRUM_CHANNEL_AUX_2].value;
      gProject->channel_data[SPEKTRUM_CHANNEL_AUX_3].value  = g_failsafe_value[SPEKTRUM_CHANNEL_AUX_3].value;
      gProject->channel_data[SPEKTRUM_CHANNEL_AUX_4].value  = g_failsafe_value[SPEKTRUM_CHANNEL_AUX_4].value;
      gProject->channel_data[SPEKTRUM_CHANNEL_AUX_5].value  = g_failsafe_value[SPEKTRUM_CHANNEL_AUX_5].value;
      gProject->channel_data[SPEKTRUM_CHANNEL_AUX_6].value  = g_failsafe_value[SPEKTRUM_CHANNEL_AUX_6].value;
      gProject->channel_data[SPEKTRUM_CHANNEL_AUX_7].value  = g_failsafe_value[SPEKTRUM_CHANNEL_AUX_7].value;

      if (TICK_COUNT_TO_SECOND(diff_tick_count) > 2)
      {
         app_timer_cnt_get(&(gProject->last_alive_tick_count));

         if (gProject->channel_data[SPEKTRUM_CHANNEL_GEAR].value > g_failsafe_value[SPEKTRUM_CHANNEL_GEAR].value)
         {
            if ((gProject->channel_data[SPEKTRUM_CHANNEL_THROTTLE].value + 11) > g_failsafe_value[SPEKTRUM_CHANNEL_THROTTLE].value)
            {
               gProject->channel_data[SPEKTRUM_CHANNEL_THROTTLE].value -= 10;
            }
         }
         else
         {
            gProject->channel_data[SPEKTRUM_CHANNEL_GEAR].value = g_failsafe_value[SPEKTRUM_CHANNEL_GEAR].value;
         }
      }
   }
   else
   {
      if (TICK_COUNT_TO_SECOND(diff_tick_count) > FAILSAFE_MODE_TIME_OUT_SECOND)
      {
         SET_PROJECT_FAILSAFE_MODE(gProject->mode);
         app_timer_cnt_get(&(gProject->last_alive_tick_count));
      }
   }


#if 0
   if (IS_PROJECT_READY_STATUS(gProject->mode) == PROJECT_READY_STATUS)
   {
      return;
   }

   if (TICK_COUNT_TO_SECOND(diff_tick_count) > FAILSAFE_MODE_TIME_OUT_SECOND)
   {
      if (IS_PROJECT_FAILSAFE_MODE(gProject->mode) != PROJECT_FAILSAFE_MODE)
      {
         uint16_t i;
         uint16_t roll, pitch, yaw;
#if defined(DEBUG_OUTPUT_FAILSAFE_MODE)
         NRF_LOG_PRINTF("[%s-%d] enter failsafe mode : %d, %d \r\n", __FUNCTION__, __LINE__, TICK_COUNT_TO_SECOND(diff_tick_count), diff_tick_count);
#endif
         gProject->enter_failsafe_mode_tick_count        = cur_tick_count;
         SET_PROJECT_NORMAL_STATUS(gProject->mode);
         SET_PROJECT_FAILSAFE_MODE(gProject->mode);

         for (i = 0; i < SPEKTRUM_MAX_CHANNEL; i++)
         {
            if (g_failsafe_value[i].channel_id == SPEKTRUM_CHANNEL_ROLL)
            {
               roll                                      = g_failsafe_value[i].value;
            }
            else if (g_failsafe_value[i].channel_id == SPEKTRUM_CHANNEL_PITCH)
            {
               pitch                                     = g_failsafe_value[i].value;
            }
            else if (g_failsafe_value[i].channel_id == SPEKTRUM_CHANNEL_YAW)
            {
               yaw                                       = g_failsafe_value[i].value;
            }
            else if (g_failsafe_value[i].channel_id == SPEKTRUM_CHANNEL_THROTTLE)
            {
               gProject->def_throttle                    = g_failsafe_value[i].value;
            }
            else if (g_failsafe_value[i].channel_id == SPEKTRUM_CHANNEL_GEAR)
            {
               gProject->def_gear                        = g_failsafe_value[i].value;
            }
         }

         for (i = 0; i < SPEKTRUM_MAX_CHANNEL; i++)
         {
            if (gProject->channel_data[i].channel_id == SPEKTRUM_CHANNEL_ROLL)
            {
               gProject->channel_data[i].value           = roll;
            }
            else if (gProject->channel_data[i].channel_id == SPEKTRUM_CHANNEL_PITCH)
            {
               gProject->channel_data[i].value           = pitch;
            }
            else if (gProject->channel_data[i].channel_id == SPEKTRUM_CHANNEL_YAW)
            {
               gProject->channel_data[i].value           = yaw;
            }
            else if (gProject->channel_data[i].channel_id == SPEKTRUM_CHANNEL_THROTTLE)
            {
               gProject->throttle                        = gProject->channel_data[i].value;
            }
            else if (gProject->channel_data[i].channel_id == SPEKTRUM_CHANNEL_GEAR)
            {
               gProject->gear                            = gProject->channel_data[i].value;
            }
            else
            {
               gProject->channel_data[i].value           = 0;
            }
         }
      }
   }

   if (IS_PROJECT_FAILSAFE_MODE(gProject->mode) == PROJECT_FAILSAFE_MODE)
   {
      uint16_t i;
      app_timer_cnt_diff_compute(cur_tick_count, gProject->enter_failsafe_mode_tick_count, &diff_tick_count);
      if (TICK_COUNT_TO_SECOND(diff_tick_count) > FAILSAFE_MODE_TIME_RUN_SECOND)
      {
         if (gProject->gear <= gProject->def_gear)
         {
            gProject->gear                               = gProject->def_gear;
            gProject->throttle                           = gProject->def_throttle;
            RESET_PROJECT_FAILSAFE_MODE(gProject->mode);
            SET_PROJECT_READY_STATUS(gProject->mode);
#if defined(DEBUG_OUTPUT_FAILSAFE_MODE)
            NRF_LOG_PRINTF("[%s-%d] enter normal mode : %d, %d \r\n", __FUNCTION__, __LINE__);
#endif
         }
         else
         {
            if (gProject->throttle <= (gProject->def_throttle + 11))
            {
               gProject->gear                            = gProject->def_gear;
               gProject->throttle                        = gProject->def_throttle;
               RESET_PROJECT_FAILSAFE_MODE(gProject->mode);
               SET_PROJECT_READY_STATUS(gProject->mode);
#if defined(DEBUG_OUTPUT_FAILSAFE_MODE)
               NRF_LOG_PRINTF("[%s-%d] enter normal mode : %d, %d \r\n", __FUNCTION__, __LINE__);
#endif
            }
            else
            {
               gProject->throttle -= 10;
            }
         }
      }
      for (i = 0; i < SPEKTRUM_MAX_CHANNEL; i++)
      {
         if (gProject->channel_data[i].channel_id == SPEKTRUM_CHANNEL_THROTTLE)
         {
            gProject->channel_data[i].value              = gProject->throttle;
         }
         else if (gProject->channel_data[i].channel_id == SPEKTRUM_CHANNEL_GEAR)
         {
            gProject->channel_data[i].value              = gProject->gear;
         }
      }
      bt_packet_to_fc_packet();
   }
#endif
}



/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


