duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
   APP_ERROR_CHECK(NRF_LOG_INIT());
   NRF_LOG_PRINTF("Drone Remote Controller ver : %d.%d.%d  \r\n",
                   (PROTOCOL_HEADER_HIGH_VERSION >> 4),
                   (PROTOCOL_HEADER_HIGH_VERSION & 0xF),
                   PROTOCOL_HEADER_LOW_VERSION);

   err_code                                              = ble_advertising_start(BLE_ADV_MODE_FAST);
   if (err_code != NRF_SUCCESS)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] ble_advertising_start() failed : %d \r\n", __FUNCTION__, __LINE__, (int) err_code);
#endif
   }
   APP_ERROR_CHECK(err_code);

#if defined(SERIAL_RECEIVER)
   if (app_timer_create(&serial_rx_timer, APP_TIMER_MODE_REPEATED, serial_receiver_timer_handler) != NRF_SUCCESS)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] Can't create app timer \r\n", __FUNCTION__, __LINE__);
#endif
   }
   if (app_timer_start(serial_rx_timer, APP_TIMER_TICKS(1, APP_TIMER_PRESCALER), NULL) != NRF_SUCCESS)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] Can't create app timer \r\n", __FUNCTION__, __LINE__);
#endif
   }

   // make default packet
   gProject->fc_tx_packet_size                        = SERIAL_RX_TRANSMITTER_MAX_SIZE;
   default_fc_packet(gProject->fc_tx_buffer, &gProject->fc_tx_packet_size);
   bt_packet_to_fc_packet();

   add_timer(timer_send_msg_to_fc_controller, SERIAL_RX_SEND_TO_FC_TIMER, -1, NULL);
   add_timer(timer_bt_command_parser, SERIAL_RX_COMMAND_PARSING_TIMER, -1, NULL);
   add_timer(timer_bt_response, SERIAL_RX_COMMAND_RESPONSE_TIMER, -1, NULL);
   add_timer(timer_failsafe_mode, SERIAL_RX_COMMAND_FAILSAFE_TIMER, -1, NULL);
#endif
   SET_PROJECT_READY_STATUS(gProject->mode);

   NRF_LOG_PRINTF("[%s-%d] Start Program ... \r\n", __FUNCTION__, __LINE__);

   // Enter main loop.
   for (;;)
   {
      power_manage();
   }
}


/**
 * @}
 */
